       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAPITULO7.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.  
               DECIMAL-POINT IS COMMA.
               SYMBOLIC CHARACTERS ESPACIO IS 47.
               
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
           MAIN-CHARACTER.
               DISPLAY ESPACIO ESPACIO ESPACIO ESPACIO.
               STOP RUN.
       END PROGRAM CAPITULO7.
       
