       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAPITULO-8.
       
       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 NUMERO PIC 99 VALUE 20.
           
       PROCEDURE DIVISION.
           DISPLAY "Número: "NUMERO.
           STOP RUN.
       END PROGRAM CAPITULO-8.
