       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAPITULO6.
       
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           MAIN-CHARACTER.
           DISPLAY "HOLA MUNDO".
           STOP RUN.
       END PROGRAM CAPITULO6.
